{
  "model_index": {
    "_class_name": "StableDiffusionPipeline",
    "unet": ["diffusers", "UNet2DConditionModel"],
    "vae": ["diffusers", "AutoencoderKL"],
    "text_encoder": ["transformers", "CLIPTextModel"],
    "tokenizer": ["transformers", "CLIPTokenizer"],
    "scheduler": ["diffusers", "PNDMScheduler"]
  },
  "repo_files": [
    "model_index.json",
    "unet/config.json",
    "unet/diffusion_pytorch_model.fp16.safetensors.index.json",
    "unet/diffusion_pytorch_model.fp16-00001-of-00002.safetensors",
    "unet/diffusion_pytorch_model.fp16-00002-of-00002.safetensors",
    "vae/config.json",
    "vae/diffusion_pytorch_model.fp16.safetensors",
    "text_encoder/config.json",
    "text_encoder/model.fp16.safetensors",
    "tokenizer/vocab.json",
    "tokenizer/merges.txt",
    "scheduler/scheduler_config.json"
  ],
  "policy": {
    "components_override": null,
    "include_optional_components": false,
    "weight_precisions": ["fp16", "bf16"],
    "allow_root_json": false
  },
  "weight_index_json_by_file": {
    "unet/diffusion_pytorch_model.fp16.safetensors.index.json": {
      "weight_map": {
        "a": "diffusion_pytorch_model.fp16-00001-of-00002.safetensors",
        "b": "diffusion_pytorch_model.fp16-00002-of-00002.safetensors"
      }
    }
  },
  "expected_files": [
    "model_index.json",
    "unet/config.json",
    "unet/diffusion_pytorch_model.fp16.safetensors.index.json",
    "unet/diffusion_pytorch_model.fp16-00001-of-00002.safetensors",
    "unet/diffusion_pytorch_model.fp16-00002-of-00002.safetensors",
    "vae/config.json",
    "vae/diffusion_pytorch_model.fp16.safetensors",
    "text_encoder/config.json",
    "text_encoder/model.fp16.safetensors",
    "tokenizer/vocab.json",
    "tokenizer/merges.txt",
    "scheduler/scheduler_config.json"
  ]
}
